package Task_One;

public class Task_1_6 {
    public static void main(String[] args) {
    System.out.println("Меня зовут Амиго.");
            System.out.println();
            System.out.print("Я согласен на зарплату $10/месяц в первыый год.\n"+
                    "Я согласен на зарплату $20/месяц во второй год.\n"+
                    "Я согласен на зарплату $30/месяц в третий год.\n"+
                    "Я согласен на зарплату $40/месяц в четвертый год.\n"+
                    "Я согласен на зарплату $50/месяц в пятый год.\n");
            System.out.println("Спасибо за щедрость, друг Риша!");

        System.out.println("----\n");

        System.out.println("Меня зовут Амиго.");
        System.out.println();
        System.out.print("Я согласен на зарплату $800/месяц в первыый год.\n" +
                "Я согласен на зарплату $1500/месяц во второй год.\n" +
                "Я согласен на зарплату $2200/месяц в третий год.\n" +
                "Я согласен на зарплату $2700/месяц в четвертый год.\n" +
                "Я согласен на зарплату $3200/месяц в пятый год.\n");
        System.out.println("Поцелуй мой блестящий металлический зад!");
            }
}
